local p = {}
local cases = {
    {"15","августа"," ","2"," "," ",["cal"]="g",["wdm2"]=1,["wy2"]=1},
    {"15","августа",nil,"2",["cal"]="g",["wdm2"]=1,["wy2"]=1},
    {"32.1.2020",["cal"]="j"},
    {"23.12.1855",["cal"]="j",["wy2"]=1,["wdm2"]=1},
    {"+2017-10-09T00:00:00Z",["cal"]="g",["wy"]=1,["wdm"]=1,["ny2"]=1,["sq_brts"]=1,["ym1"]="г."},
    {"+2017-10-09T00:00:00Z",["cal"]="g",["sq_brts"]=true},
    {"+2017-10-09T00:00:00Z",["cal"]="g",["bc"]=1,["wy"]=1,["br_in"]=1,["wdm2"]=1,["ny1"]=1,},
    {"+2017-10-09T00:00:00Z",["cal"]="j"},
    {"30","апреля",nil,"17"},
    {"30","апреля","2020","17"},
    {"31","апреля","2020"},
    {"23 juin 2020"},
    {"23 октября 2020"},
    {"23.10.2020",cal="г"},
    {"2020-10-23",cal="ю"},
}

p.run = function()
    for _, v in pairs(cases) do
        local output = (_ .. ": " .. calendar.Test(v) .. "\n")
        io.write(output)
    end
end

return p